第二轮测试截图/ELEC02汕头电力/汕头电力联机单笔缴费-测试数据.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://gdeupsb.service.bankcomm.com/basic/atomic/operation.GDEUPSELEC02Service/Schema" xmlns:gsp="http://gsp.bankcomm.com" xmlns:bbip="http://bbip.bankcomm.com">
   <soapenv:Body>
   <sch:payFeeOffChan>
      <gsp:requestInformation>
            <gsp:traceNo>2004440320150305113500013011</gsp:traceNo>
            <gsp:version>1.0</gsp:version>
         </gsp:requestInformation>
         <sch:request>
            <sch:requestHeader>
               <bbip:bbipRequestHead>
                  <bbip:chn>00</bbip:chn>
                  <bbip:reqJrnNo>2004440320150305113500013011</bbip:reqJrnNo>
                  <bbip:tlr>ABIR148</bbip:tlr>
                  <bbip:br>01441131999</bbip:br>
                  <bbip:bk>01441999999</bbip:bk>
                  <bbip:tlrTmlId>441131A</bbip:tlrTmlId>
                  <bbip:reqTme>2015-02-12T12:12:12</bbip:reqTme>
               </bbip:bbipRequestHead>
            </sch:requestHeader>
             <sch:eupsBusTyp>ELEC02</sch:eupsBusTyp>
           <sch:EDD>ELE</sch:EDD>
            <sch:FYM>201503</sch:FYM>
            <sch:QFG>1</sch:QFG>
             <sch:thdCusNo>123</sch:thdCusNo>
            <sch:busTyp>2</sch:busTyp>
            <sch:isChkAgr>0</sch:isChkAgr>
            <sch:payMde>0</sch:payMde>
            <sch:cardType>50</sch:cardType>
            <sch:txnAmt>10.00</sch:txnAmt>
         </sch:request>
      </sch:payFeeOffChan>
   </soapenv:Body>
</soapenv:Envelope>